{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 4],
              "dtype": "float32",
              "sparse": false,
              "name": "Input"
            },
            "name": "Input",
            "inbound_nodes": []
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 4],
                      "dtype": "float32",
                      "keras_history": ["Input", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 128],
                      "dtype": "float32",
                      "keras_history": ["dense", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 64],
                      "dtype": "float32",
                      "keras_history": ["dense_1", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_3",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 64],
                      "dtype": "float32",
                      "keras_history": ["dense_1", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_4",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 64],
                      "dtype": "float32",
                      "keras_history": ["dense_1", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "BMI",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "BMI",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 32],
                      "dtype": "float32",
                      "keras_history": ["dense_2", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "BMI_Class",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 6,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "BMI_Class",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 32],
                      "dtype": "float32",
                      "keras_history": ["dense_3", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "Exercise",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 6,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "Exercise",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 32],
                      "dtype": "float32",
                      "keras_history": ["dense_4", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          }
        ],
        "input_layers": [["Input", 0, 0]],
        "output_layers": [
          ["BMI", 0, 0],
          ["BMI_Class", 0, 0],
          ["Exercise", 0, 0]
        ]
      }
    },
    "training_config": {
      "loss": {
        "BMI": "mse",
        "BMI_Class": "sparse_categorical_crossentropy",
        "Exercise": "sparse_categorical_crossentropy"
      },
      "loss_weights": null,
      "metrics": {
        "BMI": ["mae"],
        "BMI_Class": ["accuracy"],
        "Exercise": ["accuracy"]
      },
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "BMI/kernel", "shape": [32, 1], "dtype": "float32" },
        { "name": "BMI/bias", "shape": [1], "dtype": "float32" },
        { "name": "BMI_Class/kernel", "shape": [32, 6], "dtype": "float32" },
        { "name": "BMI_Class/bias", "shape": [6], "dtype": "float32" },
        { "name": "Exercise/kernel", "shape": [32, 6], "dtype": "float32" },
        { "name": "Exercise/bias", "shape": [6], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [4, 128], "dtype": "float32" },
        { "name": "dense/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [128, 64], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [64, 32], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [64, 32], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense_4/kernel", "shape": [64, 32], "dtype": "float32" },
        { "name": "dense_4/bias", "shape": [32], "dtype": "float32" }
      ]
    }
  ]
}
